docs: update outdated readme
